Revit 2024 API
HVACLoadType.AreaPerPerson Property
 The area per person.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public double AreaPerPerson { get; set; }
Visual Basic
Public Property AreaPerPerson As Double
	Get
	Set
Visual C++
public:
property double AreaPerPerson {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for value must be non-negative.
See Also
HVACLoadType Class
Autodesk.Revit.DB.Analysis Namespace